applications/solvers/cokeCombustionFoam/SegregatedSteps/runs/complicatedPorousMedia/combustions/optimize/tiny2/0/decomposition
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      decomposition;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
51000
(
0
0
0
0
0
0
0
0
...
)
;

boundaryField
{
    inlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
150
(
0
0
0
0
0
0
0
0
...
)
;
    }
    outlet
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
150
(
7
7
7
7
7
7
7
7
...
)
;
    }
    top
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
340
(
1
1
1
1
1
1
1
1
...
)
;
    }
    bottom
    {
        type            extrapolatedCalculated;
        value           nonuniform List<scalar> 
340
(
0
0
0
0
0
0
0
0
...
)
;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
